presentations/git.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Git vs Subversion</title>
<!-- 2015-08-30 нд 17:28 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Andrey Kotlarski" />
<meta  name="description" content="Git presentation"
 />
<meta  name="keywords" content="git,svn,subversion,workflow,presentation,source control" />
<link rel="stylesheet" type="text/css" href="../css/worg-classic.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../sitemap.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content">
<h1 class="title">Git vs Subversion</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Annoyances with our current source control</a>
<ul>
<li><a href="#sec-1-1">1.1. Rant</a>
<ul>
<li><a href="#sec-1-1-1">1.1.1. Network traffic</a></li>
<li><a href="#sec-1-1-2">1.1.2. Hopefully we have good repository backup</a></li>
<li><a href="#sec-1-1-3">1.1.3. Clunky branch operations</a></li>
<li><a href="#sec-1-1-4">1.1.4. Merging to trunk?</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-2">2. Can it get more comfortable?</a>
<ul>
<li><a href="#sec-2-1">2.1. Distributed version control systems</a>
<ul>
<li><a href="#sec-2-1-1">2.1.1. No central repository</a></li>
<li><a href="#sec-2-1-2">2.1.2. Each node is a repo on its own</a></li>
<li><a href="#sec-2-1-3">2.1.3. Network traffic only when interacting with remote repos</a></li>
<li><a href="#sec-2-1-4">2.1.4. Most operations happen within own repo and are often instantaneous</a></li>
<li><a href="#sec-2-1-5">2.1.5. Allows alternative work-flows</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-3">3. Git</a>
<ul>
<li><a href="#sec-3-1">3.1. bla bla</a>
<ul>
<li><a href="#sec-3-1-1">3.1.1. That kernel git, Linus</a></li>
<li><a href="#sec-3-1-2">3.1.2. Known as (one of) the fastest</a></li>
<li><a href="#sec-3-1-3">3.1.3. Seems to scale well for big code bases</a></li>
</ul>
</li>
<li><a href="#sec-3-2">3.2. Virtues</a>
<ul>
<li><a href="#sec-3-2-1">3.2.1. A lot of advanced commands</a></li>
<li><a href="#sec-3-2-2">3.2.2. (local) Branches are really, really cheap</a></li>
<li><a href="#sec-3-2-3">3.2.3. <span class="underline">Allows</span> the central repository model as well</a></li>
</ul>
</li>
<li><a href="#sec-3-3">3.3. Quick start</a>
<ul>
<li><a href="#sec-3-3-1">3.3.1. Please introduce yourself</a></li>
<li><a href="#sec-3-3-2">3.3.2. initialize repository</a></li>
<li><a href="#sec-3-3-3">3.3.3. &#x2026;or clone existing one</a></li>
</ul>
</li>
<li><a href="#sec-3-4">3.4. Revisions</a>
<ul>
<li><a href="#sec-3-4-1">3.4.1. unique SHA1s, not numbers</a></li>
<li><a href="#sec-3-4-2">3.4.2. only initial characters can be used as long as uniquely identifiable</a></li>
<li><a href="#sec-3-4-3">3.4.3. HEAD, HEAD\textasciicircum , HEAD\textasciitilde 5</a></li>
</ul>
</li>
<li><a href="#sec-3-5">3.5. Branches and tags</a>
<ul>
<li><a href="#sec-3-5-1">3.5.1. git branch NAME</a></li>
<li><a href="#sec-3-5-2">3.5.2. git checkout BRANCH/REV/FILE</a></li>
<li><a href="#sec-3-5-3">3.5.3. git tag -a TAG</a></li>
<li><a href="#sec-3-5-4">3.5.4. git tag -l</a></li>
</ul>
</li>
<li><a href="#sec-3-6">3.6. Remote repos, branches and sharing</a>
<ul>
<li><a href="#sec-3-6-1">3.6.1. git checkout &#x2013;track -b BRANCH</a></li>
<li><a href="#sec-3-6-2">3.6.2. git remote add URL</a></li>
<li><a href="#sec-3-6-3">3.6.3. git pull</a></li>
<li><a href="#sec-3-6-4">3.6.4. git push origin</a></li>
</ul>
</li>
<li><a href="#sec-3-7">3.7. Merging</a>
<ul>
<li><a href="#sec-3-7-1">3.7.1. git merge BRANCH</a></li>
<li><a href="#sec-3-7-2">3.7.2. git rebase</a></li>
<li><a href="#sec-3-7-3">3.7.3. git cherry-pick REV</a></li>
</ul>
</li>
<li><a href="#sec-3-8">3.8. Get information</a>
<ul>
<li><a href="#sec-3-8-1">3.8.1. git log</a></li>
<li><a href="#sec-3-8-2">3.8.2. git status</a></li>
<li><a href="#sec-3-8-3">3.8.3. git show REV/TAG/REV:PATH-TO-FILE-OR-DIR</a></li>
</ul>
</li>
<li><a href="#sec-3-9">3.9. Recommendations</a>
<ul>
<li><a href="#sec-3-9-1">3.9.1. avoid working in master</a></li>
<li><a href="#sec-3-9-2">3.9.2. use branches for whatever little or big changes</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-4">4. Appendix</a>
<ul>
<li><a href="#sec-4-1">4.1. Links</a>
<ul>
<li><a href="#sec-4-1-1">4.1.1. man git-*</a></li>
<li><a href="#sec-4-1-2">4.1.2. official site</a></li>
<li><a href="#sec-4-1-3">4.1.3. Git - SVN crash course</a></li>
<li><a href="#sec-4-1-4">4.1.4. Successful git branching model</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Annoyances with our current source control</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Rant</h3>
<div class="outline-text-3" id="text-1-1">
</div><div id="outline-container-sec-1-1-1" class="outline-4">
<h4 id="sec-1-1-1"><span class="section-number-4">1.1.1</span> Network traffic</h4>
</div>

<div id="outline-container-sec-1-1-2" class="outline-4">
<h4 id="sec-1-1-2"><span class="section-number-4">1.1.2</span> Hopefully we have good repository backup</h4>
</div>

<div id="outline-container-sec-1-1-3" class="outline-4">
<h4 id="sec-1-1-3"><span class="section-number-4">1.1.3</span> Clunky branch operations</h4>
<div class="outline-text-4" id="text-1-1-3">
</div><ol class="org-ol"><li><a id="sec-1-1-3-1" name="sec-1-1-3-1"></a>svn copy URL1 URL2<br  /></li>
<li><a id="sec-1-1-3-2" name="sec-1-1-3-2"></a>svn checkout/switch URL2 (tea time)<br  /></li>
<li><a id="sec-1-1-3-3" name="sec-1-1-3-3"></a>uncomfortable for doing more than one quick fixes that need separate testing<br  /></li></ol>
</div>

<div id="outline-container-sec-1-1-4" class="outline-4">
<h4 id="sec-1-1-4"><span class="section-number-4">1.1.4</span> Merging to trunk?</h4>
<div class="outline-text-4" id="text-1-1-4">
</div><ol class="org-ol"><li><a id="sec-1-1-4-1" name="sec-1-1-4-1"></a>conflicts for files we haven't touched<br  /></li>
<li><a id="sec-1-1-4-2" name="sec-1-1-4-2"></a>diff + clean up conflicts + patch<br  /></li>
<li><a id="sec-1-1-4-3" name="sec-1-1-4-3"></a>single commit, bye-bye branch history<br  /></li>
<li><a id="sec-1-1-4-4" name="sec-1-1-4-4"></a>branch is unusable afterwards, refinements go directly to trunk<br  /></li></ol>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Can it get more comfortable?</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Distributed version control systems</h3>
<div class="outline-text-3" id="text-2-1">
</div><div id="outline-container-sec-2-1-1" class="outline-4">
<h4 id="sec-2-1-1"><span class="section-number-4">2.1.1</span> No central repository</h4>
<div class="outline-text-4" id="text-2-1-1">
</div><ol class="org-ol"><li><a id="sec-2-1-1-1" name="sec-2-1-1-1"></a>No, this is not a limitation<br  /></li></ol>
</div>

<div id="outline-container-sec-2-1-2" class="outline-4">
<h4 id="sec-2-1-2"><span class="section-number-4">2.1.2</span> Each node is a repo on its own</h4>
<div class="outline-text-4" id="text-2-1-2">
</div><ol class="org-ol"><li><a id="sec-2-1-2-1" name="sec-2-1-2-1"></a>no real need for backup<br  /></li></ol>
</div>

<div id="outline-container-sec-2-1-3" class="outline-4">
<h4 id="sec-2-1-3"><span class="section-number-4">2.1.3</span> Network traffic only when interacting with remote repos</h4>
</div>

<div id="outline-container-sec-2-1-4" class="outline-4">
<h4 id="sec-2-1-4"><span class="section-number-4">2.1.4</span> Most operations happen within own repo and are often instantaneous</h4>
</div>

<div id="outline-container-sec-2-1-5" class="outline-4">
<h4 id="sec-2-1-5"><span class="section-number-4">2.1.5</span> Allows alternative work-flows</h4>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Git</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> bla bla</h3>
<div class="outline-text-3" id="text-3-1">
</div><div id="outline-container-sec-3-1-1" class="outline-4">
<h4 id="sec-3-1-1"><span class="section-number-4">3.1.1</span> That kernel git, Linus</h4>
</div>
<div id="outline-container-sec-3-1-2" class="outline-4">
<h4 id="sec-3-1-2"><span class="section-number-4">3.1.2</span> Known as (one of) the fastest</h4>
</div>
<div id="outline-container-sec-3-1-3" class="outline-4">
<h4 id="sec-3-1-3"><span class="section-number-4">3.1.3</span> Seems to scale well for big code bases</h4>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Virtues</h3>
<div class="outline-text-3" id="text-3-2">
</div><div id="outline-container-sec-3-2-1" class="outline-4">
<h4 id="sec-3-2-1"><span class="section-number-4">3.2.1</span> A lot of advanced commands</h4>
<div class="outline-text-4" id="text-3-2-1">
</div><ol class="org-ol"><li><a id="sec-3-2-1-1" name="sec-3-2-1-1"></a>maybe too many for a novice, but hey, you don't need to know them to boot<br  /></li>
<li><a id="sec-3-2-1-2" name="sec-3-2-1-2"></a>fine-grained control<br  /></li>
<li><a id="sec-3-2-1-3" name="sec-3-2-1-3"></a>of course you may shoot yourself in the foot<br  /><ol class="org-ol"><li><a id="sec-3-2-1-3-1" name="sec-3-2-1-3-1"></a>however, most things are re-fixable<br  /></li></ol>
</li></ol>
</div>

<div id="outline-container-sec-3-2-2" class="outline-4">
<h4 id="sec-3-2-2"><span class="section-number-4">3.2.2</span> (local) Branches are really, really cheap</h4>
<div class="outline-text-4" id="text-3-2-2">
</div><ol class="org-ol"><li><a id="sec-3-2-2-1" name="sec-3-2-2-1"></a>this is what version control is mainly after, right<br  /></li></ol>
</div>

<div id="outline-container-sec-3-2-3" class="outline-4">
<h4 id="sec-3-2-3"><span class="section-number-4">3.2.3</span> <span class="underline">Allows</span> the central repository model as well</h4>
</div>
</div>

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> Quick start</h3>
<div class="outline-text-3" id="text-3-3">
</div><div id="outline-container-sec-3-3-1" class="outline-4">
<h4 id="sec-3-3-1"><span class="section-number-4">3.3.1</span> Please introduce yourself</h4>
<div class="outline-text-4" id="text-3-3-1">
</div><ol class="org-ol"><li><a id="sec-3-3-1-1" name="sec-3-3-1-1"></a>git config &#x2013;global user.name "Andrey Kotlarski"<br  /></li>
<li><a id="sec-3-3-1-2" name="sec-3-3-1-2"></a>git config &#x2013;global user.email akotlarski@vayant.com<br  /></li></ol>
</div>

<div id="outline-container-sec-3-3-2" class="outline-4">
<h4 id="sec-3-3-2"><span class="section-number-4">3.3.2</span> initialize repository</h4>
<div class="outline-text-4" id="text-3-3-2">
</div><ol class="org-ol"><li><a id="sec-3-3-2-1" name="sec-3-3-2-1"></a>git init<br  /></li>
<li><a id="sec-3-3-2-2" name="sec-3-3-2-2"></a>git add .<br  /></li>
<li><a id="sec-3-3-2-3" name="sec-3-3-2-3"></a>git commit -m 'Initial commit.'<br  /></li></ol>
</div>

<div id="outline-container-sec-3-3-3" class="outline-4">
<h4 id="sec-3-3-3"><span class="section-number-4">3.3.3</span> &#x2026;or clone existing one</h4>
<div class="outline-text-4" id="text-3-3-3">
</div><ol class="org-ol"><li><a id="sec-3-3-3-1" name="sec-3-3-3-1"></a>git clone URL<br  /></li></ol>
</div>
</div>

<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> Revisions</h3>
<div class="outline-text-3" id="text-3-4">
</div><div id="outline-container-sec-3-4-1" class="outline-4">
<h4 id="sec-3-4-1"><span class="section-number-4">3.4.1</span> unique SHA1s, not numbers</h4>
</div>
<div id="outline-container-sec-3-4-2" class="outline-4">
<h4 id="sec-3-4-2"><span class="section-number-4">3.4.2</span> only initial characters can be used as long as uniquely identifiable</h4>
</div>
<div id="outline-container-sec-3-4-3" class="outline-4">
<h4 id="sec-3-4-3"><span class="section-number-4">3.4.3</span> HEAD, HEAD\textasciicircum , HEAD\textasciitilde 5</h4>
</div>
</div>

<div id="outline-container-sec-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="section-number-3">3.5</span> Branches and tags</h3>
<div class="outline-text-3" id="text-3-5">
</div><div id="outline-container-sec-3-5-1" class="outline-4">
<h4 id="sec-3-5-1"><span class="section-number-4">3.5.1</span> git branch NAME</h4>
</div>
<div id="outline-container-sec-3-5-2" class="outline-4">
<h4 id="sec-3-5-2"><span class="section-number-4">3.5.2</span> git checkout BRANCH/REV/FILE</h4>
</div>

<div id="outline-container-sec-3-5-3" class="outline-4">
<h4 id="sec-3-5-3"><span class="section-number-4">3.5.3</span> git tag -a TAG</h4>
</div>
<div id="outline-container-sec-3-5-4" class="outline-4">
<h4 id="sec-3-5-4"><span class="section-number-4">3.5.4</span> git tag -l</h4>
</div>
</div>

<div id="outline-container-sec-3-6" class="outline-3">
<h3 id="sec-3-6"><span class="section-number-3">3.6</span> Remote repos, branches and sharing</h3>
<div class="outline-text-3" id="text-3-6">
</div><div id="outline-container-sec-3-6-1" class="outline-4">
<h4 id="sec-3-6-1"><span class="section-number-4">3.6.1</span> git checkout &#x2013;track -b BRANCH</h4>
</div>

<div id="outline-container-sec-3-6-2" class="outline-4">
<h4 id="sec-3-6-2"><span class="section-number-4">3.6.2</span> git remote add URL</h4>
<div class="outline-text-4" id="text-3-6-2">
</div><ol class="org-ol"><li><a id="sec-3-6-2-1" name="sec-3-6-2-1"></a>don't switch to remote branch locally!<br  /></li></ol>
</div>

<div id="outline-container-sec-3-6-3" class="outline-4">
<h4 id="sec-3-6-3"><span class="section-number-4">3.6.3</span> git pull</h4>
</div>

<div id="outline-container-sec-3-6-4" class="outline-4">
<h4 id="sec-3-6-4"><span class="section-number-4">3.6.4</span> git push origin</h4>
</div>
</div>

<div id="outline-container-sec-3-7" class="outline-3">
<h3 id="sec-3-7"><span class="section-number-3">3.7</span> Merging</h3>
<div class="outline-text-3" id="text-3-7">
</div><div id="outline-container-sec-3-7-1" class="outline-4">
<h4 id="sec-3-7-1"><span class="section-number-4">3.7.1</span> git merge BRANCH</h4>
<div class="outline-text-4" id="text-3-7-1">
</div><ol class="org-ol"><li><a id="sec-3-7-1-1" name="sec-3-7-1-1"></a>fast-forward merges<br  /></li></ol>
</div>

<div id="outline-container-sec-3-7-2" class="outline-4">
<h4 id="sec-3-7-2"><span class="section-number-4">3.7.2</span> git rebase</h4>
<div class="outline-text-4" id="text-3-7-2">
</div><ol class="org-ol"><li><a id="sec-3-7-2-1" name="sec-3-7-2-1"></a>for brave history manipulators<br  /></li>
<li><a id="sec-3-7-2-2" name="sec-3-7-2-2"></a>don't do this for public visible commits, havoc ensues!<br  /></li></ol>
</div>

<div id="outline-container-sec-3-7-3" class="outline-4">
<h4 id="sec-3-7-3"><span class="section-number-4">3.7.3</span> git cherry-pick REV</h4>
</div>
</div>

<div id="outline-container-sec-3-8" class="outline-3">
<h3 id="sec-3-8"><span class="section-number-3">3.8</span> Get information</h3>
<div class="outline-text-3" id="text-3-8">
</div><div id="outline-container-sec-3-8-1" class="outline-4">
<h4 id="sec-3-8-1"><span class="section-number-4">3.8.1</span> git log</h4>
</div>
<div id="outline-container-sec-3-8-2" class="outline-4">
<h4 id="sec-3-8-2"><span class="section-number-4">3.8.2</span> git status</h4>
</div>
<div id="outline-container-sec-3-8-3" class="outline-4">
<h4 id="sec-3-8-3"><span class="section-number-4">3.8.3</span> git show REV/TAG/REV:PATH-TO-FILE-OR-DIR</h4>
</div>
</div>

<div id="outline-container-sec-3-9" class="outline-3">
<h3 id="sec-3-9"><span class="section-number-3">3.9</span> Recommendations</h3>
<div class="outline-text-3" id="text-3-9">
</div><div id="outline-container-sec-3-9-1" class="outline-4">
<h4 id="sec-3-9-1"><span class="section-number-4">3.9.1</span> avoid working in master</h4>
<div class="outline-text-4" id="text-3-9-1">
</div><ol class="org-ol"><li><a id="sec-3-9-1-1" name="sec-3-9-1-1"></a>keep master clean and compilable, this is your face to the world normally<br  /></li></ol>
</div>

<div id="outline-container-sec-3-9-2" class="outline-4">
<h4 id="sec-3-9-2"><span class="section-number-4">3.9.2</span> use branches for whatever little or big changes</h4>
<div class="outline-text-4" id="text-3-9-2">
</div><ol class="org-ol"><li><a id="sec-3-9-2-1" name="sec-3-9-2-1"></a>instantaneous creation<br  /></li>
<li><a id="sec-3-9-2-2" name="sec-3-9-2-2"></a>commit often<br  /></li>
<li><a id="sec-3-9-2-3" name="sec-3-9-2-3"></a>it can often be in experimental state (including commits), no problem<br  /></li>

<li><a id="sec-3-9-2-4" name="sec-3-9-2-4"></a>push important branches to the remote origin for backup<br  /></li></ol>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Appendix</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Links</h3>
<div class="outline-text-3" id="text-4-1">
</div><div id="outline-container-sec-4-1-1" class="outline-4">
<h4 id="sec-4-1-1"><span class="section-number-4">4.1.1</span> man git-*</h4>
</div>
<div id="outline-container-sec-4-1-2" class="outline-4">
<h4 id="sec-4-1-2"><span class="section-number-4">4.1.2</span> <a href="http://git-scm.com">official site</a></h4>
</div>
<div id="outline-container-sec-4-1-3" class="outline-4">
<h4 id="sec-4-1-3"><span class="section-number-4">4.1.3</span> <a href="http://git.or.cz/course/svn.html">Git - SVN crash course</a></h4>
</div>
<div id="outline-container-sec-4-1-4" class="outline-4">
<h4 id="sec-4-1-4"><span class="section-number-4">4.1.4</span> <a href="http://nvie.com/posts/a-successful-git-branching-model/">Successful git branching model</a></h4>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Andrey Kotlarski</p>
<p class="date">Created: 2015-08-30 нд 17:28</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
